def view_menu():
    print('Добро пожаловать в базу данных сотрудников компании!')
    print('Меню:\n\
    1. Добавить сотрудника.\n\
    2. Удалить сотрудника.\n\
    3. Поиск информции о сотруднике по фильтру.\n\
    4. Вывести на экран всех сотрудников.\n\
    5. Остановить программу.\n\
    6. Сохранить изменения.\n')
    return int(input('Введите, пожалуйста, нужную цифру, соответствующую функции в меню. '))



